package BATcourse.Chapter13;
/**
 * 涂色问题：
 * 你要在一个nxm的格子图上涂色，你每次可以选择一个未涂色的格子涂上你开始选定的那种颜色。
 * 同时为了美观，我们要求你涂色的格子不能相邻，也就是说，不能有公共边。
 * 现在问你，在采取最优策略的情况下，你最多能涂多少个格子？给定格子图的长n和宽m。请返回最多能涂的格子数目。
 */

public class Paint {

    public int getMost(int n, int m) {
        /**
         * 只有一种颜色，要想不相邻，每行一个隔一个涂色即可.
         * (1)如果行数或者列数乘积为偶数，最多的格子即为m*n/2;
         * (2)如果行数或者列数乘积为奇数，由于int除法特性，要+1;
         */
        if (m * n % 2 == 0)
            return m * n / 2;
        else
            return m * n / 2 + 1;
    }
}
